Revit 2027 API
LoadCase.SubcategoryId Property
 Build-in or user defined subcategory of Structural Load Cases (OST_LoadCases) category.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId SubcategoryId { get; set; }
Public Property SubcategoryId As ElementId
	Get
	Set
public:
property ElementId^ SubcategoryId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member SubcategoryId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: the subcategoryId does not refer to predefined nor user defined load case category element.
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 Build-in Structural Load Cases (OST_LoadCases) subcategories are: OST_LoadCasesDeadOST_LoadCasesLiveOST_LoadCasesWindOST_LoadCasesSnowOST_LoadCasesRoofLiveOST_LoadCasesAccidentalOST_LoadCasesTemperatureOST_LoadCasesSeismic
See Also
Reference
LoadCase Class
Autodesk.Revit.DB.Structure Namespace